"""有个游戏是这样的:首先,让小朋友们围成一个大圈。然后,他随机指定一个数m,让编号为0的小朋友开始报数。每次喊到m-1的那个小朋友
要出列唱首歌,然后可以在礼品箱中任意的挑选礼物,并且不再回到圈中,从他的下一个小朋友开始,继续0...m-1报数....这样下去....
直到剩下最后一个小朋友,可以不用表演,并且拿到牛客名贵的“名侦探柯南”典藏版(名额有限哦!!^_^)。请你试着想下,哪个小朋友会
得到这份礼品呢？(注：小朋友的编号是从0到n-1)
"""

class Solution:
    def LastRemaining_Solution(self, n, m):
        if n <= 0 or m <= 0:
            return -1
        l = [i for i in range(n)]
        index = 0                           # 要记录这个索引，上一次出列的位置
        while len(l) > 1:
            index = (m+index-1) % len(l)    # +index，从上次出列的位置开始下一轮游戏，【注意要 %模掉先有数组的长度，而不是第一次开始的长度n】
            l.pop(index)
        return l[0]
