"""题目描述：
在Z省，有若干个个城市坐落在一条直线上，从左到右依次标号1,2,3,…，其中每个城市有一个火车站点，现今已经开放了n条火车路线，
第i条火车路线是从第Yi个城市到第Xi个城市，因为Z省地势奇特，标号小的城市地势较低，所以火车是从高往低开的，再通过神秘力量传送回高地，
即Yi一定大于Xi，它在沿途的所有城市都会停靠（显然不包括起点Yi，但是包括终点Xi），火车停靠就需要火车站台来运营维护。火车
站台随着运营线路的数量不同，其损耗速度、维护成本也各异，现在我们想知道所有站台中，所运营的线路数最大是多少。
输入
第一行一个数n。（1≤n≤100000）
接下来n行每行两个数Xi和Yi，分别代表第i条火车路线的终点和起点。（1≤Xi<Yi≤1e5）
输出
共一行，一个非负整数，表示最大运营路线数。
样例输入
4
4 7
2 6
2 5
1 2
样例输出
3
提示
第一条涉及站台6，5，4
第二条涉及站台5，4，3，2
第三条涉及站台4，3，2
第四条涉及站台1
所以显然站台4运营的线路最多，有3条
"""


# 超时 36%
def func(n, arr):
    dict1 = {}
    for i in range(n):
        for j in range(arr[i][0], arr[i][1]):
            dict1[j] = dict1.get(j, 0) + 1
    a = sorted(dict1.items(), key=lambda x: x[1])
    return a[-1][1]


n = int(input())
arr = []
for _ in range(n):
    arr.append([int(i) for i in input().split()])
print(func(n, arr))
