"""京京和东东是好朋友。东东很喜欢回文。回文是指从前往后读和从后往前读是一样的词语。京京准备给东东一个惊喜,先取定一个字符串s,然后在后面附上0个或者更多个字母形成回文,京京希望这个回文越短越好。请帮助京京计算他能够得到的最短的回文长度。
输入描述:
输入包括一个字符串s,字符串s长度length(1 ≤ length ≤ 50)
输出描述:
输出一个整数,表示牛牛能够得到的最短的回文长度。
示例1
输入
abab
输出
5
"""
'''以abab为例，你在后面添加a，由于a和a是回文的，你只要判断bab是否回文？
同理，以abcc为例，你在后面添加ba，ba和ab是回文的，你只要判断cc是否回文？
所以在 一个任意字符串 s; 你在后面添加i个字符，由于前i个字符和后面i个字符是回文的，你只要判断从i位置起，长度为s.s.length()-i 的子串是否回文。
'''


s = input()
length = len(s)
index = 0
for i in range(length):
    if s[i:] == s[-1:-(length-i)-1:-1]:
        index = i
        break
print(length + index)
