"""格雷编码是一个二进制数字系统，在该系统中，两个连续的数值仅有一个位数的差异。
给定一个代表编码总位数的非负整数 n，打印其格雷编码序列。格雷编码序列必须以 0 开头。
示例 1:
输入: 2
输出: [0,1,3,2]
解释:
00 - 0      01 - 1      11 - 3      10 - 2
对于给定的 n，其格雷编码序列并不唯一。
例如，[0,2,3,1] 也是一个有效的格雷编码序列。
00 - 0      10 - 2    11 - 3        01 - 1

示例 2:
输入: 0
输出: [0]
解释: 我们定义格雷编码序列必须以 0 开头。 给定编码总位数为 n 的格雷编码序列，其长度为 2n。当 n = 0 时，长度为 20 = 1。
     因此，当 n = 0 时，其格雷编码序列为 [0]。
"""
''' 生成二进制格雷码方式（假设原始的值从0开始）：
    第一步，改变最右边的位元值；
    第二步，改变右起第一个为1的位元的左边位元；
    第三步，重复第一步和第二步，直到所有的格雷码产生完毕（即已经走了(2^n) - 1 步）.
n位元格雷码： n=3时为 000、001、011、010、110、111、101、100
如要生成4位元格雷码，只需在3位元格雷码上再加一层0,1就可以了：0000,0001,0011,0010,0110,0111,0101,0100,1100,1101,1110,1010,0111,1001,1000.
也就是说，n位元格雷码是基于n-1位元格雷码产生的'''


def grayCode(n):
    ans = [0]
    for i in range(n):
        for j in range(len(ans) - 1, -1, -1):
            ans.append(1 << i | ans[j])
    return ans


# 直接记公式
def grayCode1( n):
    return [i ^ i >> 1 for i in range(1 << n)]
